# Empty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPath..::..Empty Property
ModelPath Class See Also
---
Whether this path is empty
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool Empty { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Empty As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Empty {
	bool get ();
}
```

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace